# Программа получает на вход два числа и находит их НОД
'''
import math
a = int(input("Введите первое число:"))
b = int(input("Введите второе число:"))
print(math.gcd(a, b))
'''



r
# 